
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖

<details><summary>Show Plan</summary>

```
tofu
module.ecs_dev.data.aws_iam_policy_document.ecs_task_assume_role_policy: Reading...
module.ecs_dev.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:eu-central-1:313193269185:cluster/mediamind-cluster]
module.ecs.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:eu-central-1:313193269185:cluster/mediamind-cluster]
module.ecs.aws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/mediamind-service]
module.qdrant.aws_efs_file_system.qdrant: Refreshing state... [id=fs-04611310d7d2b8293]
module.qdrant.aws_cloudwatch_log_group.qdrant: Refreshing state... [id=/ecs/mediamind-qdrant]
module.ecs_dev.aws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/mediamind-service-dev]
module.ecr.aws_ecr_repository.ecr: Refreshing state... [id=ecr-mediamind]
module.ecs_dev.data.aws_iam_policy_document.ecs_task_assume_role_policy: Read complete after 0s [id=1077804475]
data.aws_vpc.selected: Reading...
module.qdrant.data.aws_iam_policy_document.qdrant_task_assume_role_policy: Reading...
module.qdrant.data.aws_iam_policy_document.qdrant_task_assume_role_policy: Read complete after 0s [id=1077804475]
module.redis.aws_elasticache_cluster.redis: Refreshing state... [id=mediamind-redis]
data.aws_secretsmanager_secret_version.creds: Reading...
data.aws_secretsmanager_secret_version.creds: Read complete after 0s [id=arn:aws:secretsmanager:eu-central-1:313193269185:secret:mediamind/app-env-fUauFQ|AWSCURRENT]
module.ecs.data.aws_iam_policy_document.ecs_task_assume_role_policy: Reading...
module.ecs.data.aws_iam_policy_document.ecs_task_assume_role_policy: Read complete after 0s [id=1077804475]
module.scheduler_dev.data.aws_iam_policy_document.ecs_task_assume_role_policy: Reading...
module.scheduler_dev.data.aws_iam_policy_document.ecs_task_assume_role_policy: Read complete after 0s [id=1077804475]
module.s3.aws_s3_bucket.backend: Refreshing state... [id=eutop-mediamind]
module.ecs_dev.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=mediamind-service-dev-ecs-task-execution]
module.qdrant.aws_iam_role.qdrant_task_execution_role: Refreshing state... [id=mediamind-qdrant-task-execution]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=mediamind-service-ecs-task-execution]
module.database.aws_db_instance.postgres: Refreshing state... [id=db-JTOTX5CRVLOAA47F5LJFTYSYJA]
module.qdrant.aws_iam_role_policy_attachment.qdrant_task_execution_role_policy: Refreshing state... [id=mediamind-qdrant-task-execution-20250529181739908900000001]
module.qdrant.aws_ecs_task_definition.qdrant: Refreshing state... [id=mediamind-qdrant]
module.ecs.aws_iam_role_policy.ecs_secrets: Refreshing state... [id=mediamind-service-ecs-task-execution:mediamind-service-secrets]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=mediamind-service-ecs-task-execution-20250529150109931500000002]
module.ecs_dev.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=mediamind-service-dev-ecs-task-execution-20250619150554273500000002]
module.ecs_dev.aws_iam_role_policy.ecs_secrets: Refreshing state... [id=mediamind-service-dev-ecs-task-execution:mediamind-service-dev-secrets]
data.aws_vpc.selected: Read complete after 1s [id=vpc-07a194586a2bb7a62]
data.aws_subnets.selected: Reading...
module.scheduler_dev.data.aws_vpc.selected: Reading...
module.ecs_dev.data.aws_vpc.selected: Reading...
module.ecs.data.aws_vpc.selected: Reading...
module.qdrant.aws_security_group.qdrant: Refreshing state... [id=sg-0f4f72368e2d52623]
module.alb.aws_lb_target_group.prod: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:targetgroup/mediamind-prod-tg/2ef77808e9f6efcf]
module.alb.aws_lb_target_group.dev: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:targetgroup/mediamind-dev-tg/fc7b4c7d8735e7e2]
module.alb.aws_security_group.alb: Refreshing state... [id=sg-0ca55e65142f73283]
data.aws_subnets.selected: Read complete after 0s [id=eu-central-1]
module.qdrant.aws_efs_mount_target.qdrant["subnet-0f691c9f6c562fab6"]: Refreshing state... [id=fsmt-06b0ba38a3120241e]
module.qdrant.aws_efs_mount_target.qdrant["subnet-0d990bb33ae872102"]: Refreshing state... [id=fsmt-0c39849845d78983d]
module.qdrant.aws_ecs_service.qdrant: Refreshing state... [id=arn:aws:ecs:eu-central-1:313193269185:service/mediamind-cluster/mediamind-qdrant]
module.qdrant.aws_efs_mount_target.qdrant["subnet-0910d308a8661b1da"]: Refreshing state... [id=fsmt-0e0a3662e8daddc56]
module.alb.aws_lb.shared: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:loadbalancer/app/mediamind-shared-alb/8f0bd898ec9e9899]
module.ecs_dev.aws_security_group.ecs_service: Refreshing state... [id=sg-085a3500157b26cd4]
module.ecs.aws_security_group.ecs_service: Refreshing state... [id=sg-0cd43e1101e5aa36f]
module.ecs_dev.aws_ecs_task_definition.app: Refreshing state... [id=mediamind-service-dev]
module.ecs.aws_ecs_task_definition.app: Refreshing state... [id=mediamind-service]
module.scheduler_dev.data.aws_vpc.selected: Read complete after 1s [id=vpc-07a194586a2bb7a62]
module.ecs_dev.aws_ecs_service.app: Refreshing state... [id=arn:aws:ecs:eu-central-1:313193269185:service/mediamind-cluster/mediamind-service-dev]
module.ecs.aws_ecs_service.app: Refreshing state... [id=arn:aws:ecs:eu-central-1:313193269185:service/mediamind-cluster/mediamind-service]
module.ecs_dev.data.aws_vpc.selected: Read complete after 1s [id=vpc-07a194586a2bb7a62]
module.ecs.data.aws_vpc.selected: Read complete after 1s [id=vpc-07a194586a2bb7a62]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener/app/mediamind-shared-alb/8f0bd898ec9e9899/e09f7359667f4dcd]
module.alb.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener/app/mediamind-shared-alb/8f0bd898ec9e9899/fce8c595bc0f1445]
module.alb.aws_lb_listener_certificate.dev: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener/app/mediamind-shared-alb/8f0bd898ec9e9899/fce8c595bc0f1445_arn:aws:acm:eu-central-1:313193269185:certificate/3f5b9917-f56f-414a-ab56-b751c55733ee]
module.alb.aws_lb_listener_rule.dev: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener-rule/app/mediamind-shared-alb/8f0bd898ec9e9899/fce8c595bc0f1445/44c9497fc1f6664b]
module.alb.aws_lb_listener_rule.prod: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener-rule/app/mediamind-shared-alb/8f0bd898ec9e9899/fce8c595bc0f1445/cc7eadcfbd27778c]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.ecr_scheduler.aws_ecr_repository.ecr will be created
  + resource "aws_ecr_repository" "ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ecr-mediamind-scheduler"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.scheduler_dev.aws_cloudwatch_log_group.ecs will be created
  + resource "aws_cloudwatch_log_group" "ecs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/mediamind-scheduler-dev"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.scheduler_dev.aws_ecs_cluster.this will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "mediamind-cluster"
      + tags_all = (known after apply)

      + setting (known after apply)
    }

  # module.scheduler_dev.aws_ecs_service.app will be created
  + resource "aws_ecs_service" "app" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "mediamind-scheduler-dev"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + subnets          = [
              + "subnet-0910d308a8661b1da",
              + "subnet-0d990bb33ae872102",
              + "subnet-0f691c9f6c562fab6",
            ]
        }
    }

  # module.scheduler_dev.aws_ecs_task_definition.app will be created
  + resource "aws_ecs_task_definition" "app" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "264"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "mediamind-scheduler-dev"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + track_latest             = false
    }

  # module.scheduler_dev.aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "mediamind-scheduler-dev-ecs-task-execution"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.scheduler_dev.aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "mediamind-scheduler-dev-ecs-task-execution"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>
